Задание 1

Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [ ]:
import pandas as pd

In [ ]:
df_ratings = pd.read_csv('https://github.com/Kitchess/Netology/tree/master/hw_11/ratings.csv')
df_ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [ ]:
df_movies = pd.read_csv('/https://github.com/Kitchess/Netology/tree/master/hw_11/movies.csv')
df_movies.head()

   movieId  ...                                       genres
0        1  ...  Adventure|Animation|Children|Comedy|Fantasy
1        2  ...                   Adventure|Children|Fantasy
2        3  ...                               Comedy|Romance
3        4  ...                         Comedy|Drama|Romance
4        5  ...                                       Comedy

[5 rows x 3 columns]

In [ ]:
df_merged = df_ratings.merge(df_movies, on='movieId', how='left')

In [ ]:
rating = df_merged[['movieId', 'title', 'rating']]
rating.head()

   movieId                        title  rating
0        1             Toy Story (1995)     4.0
1        3      Grumpier Old Men (1995)     4.0
2        6                  Heat (1995)     4.0
3       47  Seven (a.k.a. Se7en) (1995)     5.0
4       50   Usual Suspects, The (1995)     5.0

In [ ]:
rating_5 = rating[(rating['rating'] == 5.0)]

In [ ]:
count_movies = rating_5.groupby(['movieId' , 'title'])['movieId']\
.count().sort_values(ascending=False).head()
count_movies

movieId  title
318      Shawshank Redemption, The (1994)             153
296      Pulp Fiction (1994)                          123
356      Forrest Gump (1994)                          116
2571     Matrix, The (1999)                           109
260      Star Wars: Episode IV - A New Hope (1977)    104
Name: movieId, dtype: int64

Задание 2

По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [ ]:
df_power = pd.read_csv('https://github.com/Kitchess/Netology/tree/master/hw_11//power.csv')

df_power.head()

   country  year  quantity  category
0  Austria  1996       5.0       1.0
1  Austria  1995      17.0       1.0
2  Belgium  2014       0.0       1.0
3  Belgium  2013       0.0       1.0
4  Belgium  2012      35.0       1.0

In [ ]:
baltics = df_power[(df_power['country']=='Estonia')\
| (df_power['country']=='Lithuania')\
| (df_power['country']=='Latvia') ]

baltics.head()

       country  year  quantity  category
373  Lithuania  2014      39.0       1.0
374  Lithuania  2013     192.0       1.0
375  Lithuania  2012     196.0       1.0
376  Lithuania  2011     171.0       1.0
377  Lithuania  2010     158.0       1.0

In [ ]:
filtered_data = baltics[(baltics['category']==4) \
| (baltics['category']==12) | (baltics['category']==21)\
& (baltics['year']<2010) & (baltics['year']>2005) & (baltics['quantity'] >= 0)]

filtered_data.head()

       country  year  quantity  category
10617  Estonia  2008       1.0       4.0
10618  Estonia  2007       0.0       4.0
10619  Estonia  2006       0.0       4.0
10620  Estonia  2005       1.0       4.0
10621  Estonia  2004       1.0       4.0

In [ ]:
filtered_data.quantity.sum()

165867.0

Задание 3

Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.

In [ ]:
df = pd.read_html('https://www.wordstream.com/blog/ws/2016/02/29/google-adwords-industry-benchmarks')[1]

df.head()

             Industry Average CPC (Search) Average CPC (GDN)
0            Advocacy                $1.43             $0.62
1                Auto                $2.46             $0.58
2                 B2B                $3.33             $0.79
3   Consumer Services                $6.40             $0.81
4  Dating & Personals                $2.78             $1.49